{
  "news": [
    {
      "id": "release-day-status",
      "title": "Release Day Status",
      "author": "Snowy ♡",
      "published_at": "2025-12-15T19:24:00",
      "summary": "Thank you for joining us on release day! We’re blown away by the turnout and want to share the current server status and what’s coming next.",
      "sections": [
        {
          "type": "intro",
          "content": "Hi everyone! Thank you for joining us on our release day. We're pleasantly surprised by the turnout and are super excited to see everyone having such a fun time. With that said, we want to take a moment to talk about the current status of the server and plans moving forward."
        },
        {
          "type": "known_issues",
          "title": "Known Issues",
          "description": "A lot of new bugs have come to light today and will be worked on promptly. While there’s no exact ETA, most issues should be resolved within about a week.",
          "items": [
            {
              "title": "Rat Wars soft-locks",
              "details": "Rat Wars may soft lock. Avoid it for now unless you're okay risking a lock just to play."
            },
            {
              "title": "Races soft-lock on results",
              "details": "Less common, but if it happens you can Alt+F4 and rejoin to recover."
            },
            {
              "title": "Activity system timer freezes",
              "details": "Activities (including races) may randomly lock up, preventing new activities from starting."
            },
            {
              "title": "Chat is overwhelming",
              "details": "Chat muting and hiding options are coming soon to reduce noise and connection spam."
            },
            {
              "title": "Clothing and tattoos don’t work",
              "details": "Purchasing these currently has no effect. Don’t waste your money — proper systems are coming."
            }
          ]
        },
        {
          "type": "forward_looking",
          "title": "Moving Forward",
          "content": "The server will remain open despite the issues above. This is only the beginning — fixes, improvements, and new features are already in motion. We’re just getting started. Stay tuned! <3"
        }
      ]
    }
  ]
}
