{
  "news": [
    {
      "id": "release-day-status",
      "title": "Release Day Status",
      "author": "Snowy ♡",
      "date": "2025-12-15",
      "time": "19:24",
      "published_at": "2025-12-15T19:24:00",
      "summary": "Thank you for joining us on release day! We’re blown away by the turnout and want to share the current server status and what’s coming next.",
      "sections": [
        {
          "type": "intro",
          "content": "Hi everyone! Thank you for joining us on our release day. We're pleasantly surprised by the turn out, and are super excited to see everyone having such a fun time. With that said though, I'd like to take a moment to talk about the current status of the server, and plans moving forward."
        },
        {
          "type": "known_issues",
          "title": "Known Issues",
          "description": "A lot of new bugs have come to light today, and will be worked on promptly. Although there's not an exact time frame, I don't see the majority of issues taking more than a week to get fixed. Here's a list of some of the biggest current issues (not all).",
          "items": [
            {
              "title": "Rat Wars tends to soft lock.",
              "details": "For the time being it is suggested you stay away from Rat Wars unless you want to risk getting soft locked just to play it."
            },
            {
              "title": "Races get soft locked on results.",
              "details": "Another known soft lock, but seemingly less common. If you run into this, you can Alt+F4 to quit your game instantly then re-join. Sorry for the inconvenience."
            },
            {
              "title": "Activity system timer freezes.",
              "details": "As you may have noticed, races are a form of \"activity\". However, there's an issue with the activity system that locks the whole system up at seemingly random. You may struggle to start activities for the time being."
            },
            {
              "title": "The chat is too big / annoying.",
              "details": "While the huge turn-out has been awesome, it's definitely shown that chat muting / hiding features are absolutely necessary. These new options will be implemented sometime soon, so you won't have to keep hearing the connection noises and constant messages if you don't want to."
            },
            {
              "title": "I can't buy clothing or tattoos.",
              "details": "Please don't burn your money trying to buy these things. They will do nothing for your online character. Proper clothing options will be added soon, but we're not there quite yet."
            }
          ]
        },
        {
          "type": "forward_looking",
          "title": "Moving Forward",
          "content": "The server is going to be left open for all of you to enjoy despite the issues mentioned above. Still, we all want to make it expressly clear we are just getting started. There will be many more fixes and new features coming soon. Stay tuned! <3"
        }
      ]
    },
    {
      "id": "account-creation-issue",
      "title": "Account Creation Issues",
      "author": "PixeL",
      "date": "2025-12-15",
      "time": "21:05",
      "summary": "We're aware of problems regarding not being able to create new accounts on https://swegta.com/online/. This problem is on our end and we'll have it fixed in the morning."
    }
  ]
}
